import React from "react";

const Terms = () => {
  return (
    <div className="max-w-5xl mx-auto my-16 flex flex-col gap-3">
      <h2 className="mx-8 font-bold">Умови надання послуг</h2>
      <i>
        Востаннє оновлено: <strong>13 січня 2018</strong>
      </i>
      <h4 className="mx-8 font-bold">1. Загальні положення</h4>
      <p>
        Для того, щоб користуватися цим веб-сайтом (далі – Сервіс, Сайт), який
        знаходиться за адресою <a href="/">Movie List</a>, спершу потрібно
        зареєструватися через наш процес реєстрації на цьому Сайті та прийняти
        ці Умови надання послуг (далі – Умови, Угода).
      </p>
      <p>
        Незалежно від того, як ви вирішили використовувати цей Сайт, ваша
        поведінка на цьому Сайті та використання цього Сервісу регулюється цими
        Умовами.
      </p>
      <p>
        <strong>
          ОТРИМУЮЧИ ДОСТУП ДО СЕРВІСУ ЧИ ВИКОРИСТОВУЮЧИ ЙОГО, ВИ ПОГОДЖУЄТЕСЯ ІЗ
          ЦИМИ УМОВАМИ. ЯКЩО ВИ НЕ ПОГОДЖУЄТЕСЯ З ЦИМИ УМОВАМИ, ТОДІ НЕ
          ВИКОРИСТОВУЙТЕ ЦЕЙ САЙТ.
        </strong>
      </p>
      <p>
        У випадку, якщо ви НЕ погоджуєтеся із цими Умовами, будь ласка, зверніться до
        адміністратора і повідомте про це.
      </p>
      <p>
        Умови створено для урівноваження прав для зареєстрованих і
        незареєстрованих користувачів (далі - користувачі) Сайту.
      </p>
      <p>
        Адміністрація (далі - адміністратор, модератор) залишає за собою право
        за власним баченням видаляти чи редагувати повідомлення користувачів. За
        порушення даних Умов, користувача може бути заблоковано без
        попередження.
      </p>
      <p>
        Основною мовою для спілкування на Сайті є українська.
      </p>
      <p>
        В якості джерела даних, цей Сайт використовує сервіс TMDB, який
        знаходиться за адресою: https://www.themoviedb.org. Сайт не несе
        відповідальності за вміст, який відображається із цього сервісу.
      </p>
      <h4 className="mx-8 font-bold">2. Членство</h4>
      <p>Реєструючись та використовуючи цей Сайт, ви підтверджуєте наступне:</p>
      <ul>
        <li>
          "Ім'я для відображення" може містити ваше справжнє ім'я та прізвище,
          проте це не обов'язково;
        </li>
        <li>
          ви оновлюватимете свою контактну інформацію, якщо вона зміниться, щоб
          ми могли з вами зв'язатися;
        </li>
        <li>
          ваше використання даного Сайту та використання вами послуг, доступних
          на цьому Сайті, не порушують жодного чинного законодавства а також цих
          Умов;
        </li>
        <li>вам виповнилося 13 років;</li>
        <li>
          ви будете дотримуватися правил поведінки користувачів, які вказані в
          пункті 3 цих Умов.
        </li>
      </ul>
      <p>
        Усі введені користувачем дані під час реєстрації{" "}
        <strong>не повинні</strong>:
      </p>
      <ul>
        <li>порушувати правила моралі;</li>
        <li>містити рекламу;</li>
        <li>містити ненормативну лексику;</li>
        <li>
          включати спеціальні символи та знаки, які можуть зашкодити роботі
          Сайту.
        </li>
      </ul>
      <p>
        Ви несете відповідальність за збереження пароля, який ви використовуєте
        для доступу до Сервісу. Ви погоджуєтеся не розголошувати свій пароль
        будь-якій третій стороні. Ви повинні повідомити нас відразу ж дізнавшись
        про будь-яке порушення безпеки чи несанкціоноване використання вашого
        облікового запису.
      </p>
      <h4 className="mx-8 font-bold">3. Поведінка користувачів</h4>
      <p>Цей Сайт може забезпечити функції для спілкування (далі – Внески).</p>
      <p>
        Будь ласка, прочитайте нашу Політику конфіденційності, доступну на
        <a href="/">Політика конфідинційності</a>, щоб зрозуміти ваш захист
        конфіденційності.
      </p>
      <p>
        Ви несете повну відповідальність за зміст та будь-яку шкоду, спричинену
        будь-якими вашими публікаціями.
      </p>
      <p>Всім без вийнятку заборонено:</p>
      <ul>
        <li>
          проявляти неповагу (використовуючи грубість, погрози, образи чи
          нецензурні вислови, в тому числі в завуальованій формі);
        </li>
        <li>надсилати однакові або подібні повідомлення (флуд);</li>
        <li>писати повідомлення рекламного чи комерційного характеру;</li>
        <li>
          публічно виявляти неповагу до дій модератора або адміністратора;
        </li>
        <li>проявляти расову, релігійну чи національну неприязнь;</li>
        <li>зловживати заголовними буквами;</li>
        <li>
          зловживати спеціальними символами (наприклад, :)))))))) та інше)
        </li>
        <li>проводити обговорення поза темою;</li>
      </ul>
      <p>
        Спілкування російською мовою допускається лише за умови, якщо таке
        спілкування не створює суперечок між користувачами. В іншому разі,
        користувач зобов'язаний писати публікацію виключно українською мовою.
      </p>
      <h4 className="mx-8 font-bold">4. Ліцензія на Внески</h4>
      <p>
        Ми не претендуємо на будь-які права власності в ваших публікаціях, які
        ви публікуєте на цьому Сайті і не несемо відповідальності за будь-які
        можливі порушення авторських прав.
      </p>
      <p>
        Після опублікування Ваших матеріалів на цьому Сайті ви продовжуєте
        зберігати будь-які права, які можуть мати Ваші публікації, включаючи
        будь-які права інтелектуальної власності чи інші майнові права,
        пов'язані з вашими публікаціями.
      </p>
      <p>
        Якщо ви надаєте нам будь-який зворотній зв'язок (наприклад, пропонуєте
        нові функції, виправлення, покращення тощо), ви назначаєте всі права,
        титул та інтерес такого звертання до нас і підтверджуєте, що ми будемо
        мати право здійснювати, використовувати будь-який такий зворотній
        зв'язок будь-яким способом без будь-яких обмежень або обов'язків.
      </p>
      <p>
        Ви також погоджуєтеся та підтверджуєте те, що ми не зобов'язані діяти по
        відношенню такого зворотнього зв'язку.
      </p>
      <p>
        Для претензій щодо порушення авторських прав, будь ласка, зв'яжіться з
        нами через нашу{" "}
        <a href="/" target="_blank" rel="noreferrer noopener">
          Службу Підтримки
        </a>
        .
      </p>
      <h4 className="mx-8 font-bold">
        5. Наше керування цим сайтом / неправомірною поведінкою користувача
      </h4>
      <u className="font-bold">5.1 Наш менеджмент Сайту.</u>
      <p>Ми можемо, але не зобов'язані:</p>
      <ul>
        <li>
          контролювати чи переглядати цей Сайт за порушення цієї Угоди та
          відповідність нашій політиці;
        </li>
        <li>
          звітувати перед правоохоронними органами та/або вживати заходів проти
          будь-кого, хто порушує законодавство;
        </li>
        <li>
          блокувати, обмежувати доступ, видаляти облікові записи користувачів у
          разі порушення ними цих Умов, без згоди цих користувачів;
        </li>
        <li>
          керувати цим Сайтом таким чином, щоб захистити права та майно наших та
          третіх сторін або сприяти належному функціонуванню цього Сайту;
        </li>
        <li>
          видаляти, редагувати матеріали, опубліковані користувачами, без
          попередньої згоди на це.
        </li>
      </ul>
      <u className="font-bold">
        5.2 Наше право припинити дію облікових записів користувачів.
      </u>
      <p>
        Не обмежуючи будь-яке інше положення цієї Угоди, ми залишаємо за собою
        право на власний розсуд і без повідомлення та відповідальності
        забороняти доступ на використання даного Сайту будь-якій особі з
        будь-якої причини або без будь-яких причин.
      </p>
      <u className="font-bold">5.3 Ризик шкоди.</u>
      <p>
        Майте на увазі, що існують ризики фізичної, психічної та іншої шкоди, в
        наслідок спілкуватися з незнайомими людьми, включаючи осіб, які можуть
        діяти помилково.
      </p>
      <p>
        Будь ласка, обережно вибирайте інформацію, яку ви публікуєте на цьому
        Сайті, і яку ви надаєте іншим користувачам сайту.
      </p>
      <p>
        Ви не зобов'язані публічно опублікувати своє справжнє ім'я, номери
        телефонів, адреси чи іншу інформацію, яка ідентифікує вас або дозволяє
        незнайомим людям знайти вас або вкрасти вашу особу.
      </p>
      <p>
        Незважаючи на цю заборону, інформація інших людей може бути нав'язливою,
        шкідливою або неточною, а в деяких випадках вона буде обманливою.
      </p>
      <p>
        Ви берете на себе всі ризики, пов'язані з роботою з іншими
        користувачами, з якими ви контактуєте через цей Сайт.
      </p>
      <p>
        Ми очікуємо, що під час використання цього Сайту ви будете
        використовувати обережність та здоровий глузд.
      </p>
      <h4 className="mx-8 font-bold">6. Зміни</h4>
      <p>
        Інтернет та технології швидко змінюються. Відповідно, ми можемо
        періодично змінювати цю Угоду без попередження, і ви несете повну
        відповідальність за її уважне прочитання та перевірку будь-яких можливих
        змін.
      </p>
      <p>
        Оскільки зміни будуть розміщені на цій сторінці, радимо регулярно
        перевіряти цю сторінку. Ваше безперервне використання цього Сайту дає
        Вашу згоду з такими змінами.
      </p>
      <h4 className="mx-8 font-bold">
        7. Некомерційне використання користувачами
      </h4>
      <p>
        Сайт доступний тільки для особистого використання, і ви не можете
        використовувати Сайт або будь-які матеріали, опубліковані на Сайті, в
        зв'язку з якою-небудь комерційною діяльністю, за винятком тих, які
        спеціально схвалені нами.
      </p>
      <h4 className="mx-8 font-bold">8. Посилання на інші веб-сайти</h4>
      <p>
        Цей сайт може містити посилання на інші веб-сайти (далі – "сторонні
        сайти", "сайти третіх сторін").
      </p>
      <p>
        Ми не володіємо та не керуємо сайтами третіх сторін, і ми не розглядали,
        і не можемо переглядати, всі матеріали, в тому числі товарів або послуг,
        яка доступна через сайти третіх сторін.
      </p>
      <p>
        Матеріали третьої сторони, доступ до яких здійснюється або
        використовуються за допомогою сайтів третьої сторони, також можуть бути
        захищені авторським правом та іншими законами про інтелектуальну
        власність.
      </p>
      <p>
        ЦЯ УГОДА НЕ ЗАСТОСОВУЄТЬСЯ ДО САЙТІВ ТРЕТІХ СТОРІН. ПЕРЕД ВИКОРИСТАННЯМ
        ТАКОГО САЙТУ, ПОСИЛАННЯ НА ЯКИЙ Є НА ЦЬОМУ СЕРВІСІ, КОРИСТУВАЧІ ПОВИННІ
        ОЗНАЙОМИТИСЯ З УМОВАМИ ВИКОРИСТАННЯ ТРЕТЬОЇ СТОРОНИ І, ПОЛІТИКОЮ
        КОНФІДЕНЦІЙНОСТІ ТА ВСІМА ІНШИМИ ДОКУМЕНТАМИ, ПЕРЕДБАЧЕНИМИ САЙТОМ
        ТРЕТЬОЇ СТОРОНИ.
      </p>
      <p>Забороняється публікувати посилання на:</p>
      <ul>
        <li>
          файлообмінники, варезники, FTP та сторонні торрент-трекери,
          онлайн-бібліотеки, соціальні мережі;
        </li>
        <li>сайти, що містять еротичний та порнографічний контент;</li>
        <li>
          сайти, що містять заклики до насильства, расової, релігійної чи
          національної нетерпимості, порушення норм і правил загальнолюдської
          моралі;
        </li>
        <li>сайти, які не стосуються тематики цього Сайту</li>
      </ul>
      <h4 className="mx-8 font-bold">9. Суперечки між користувачами</h4>
      <p>Ви несете повну відповідальність за вашу поведінку.</p>
      <p>
        Сайт не несе відповідальності за вміст матеріалів, опубліковані
        користувачами.
      </p>
      <p>
        Ви погоджуєтеся, що ми не можемо відповідати за будь-які суперечки, які
        виникають між вами та будь-яким іншим користувачем.
      </p>
      <p>
        Ми можемо розміщувати рекламу та рекламні акції від третіх сторін на
        Сайті.
      </p>
      <p>
        Ваша кореспонденція або ділові стосунки з рекламою або участь у рекламі
        інших рекламодавців, крім нас, на нашому сайті або через Сайт, включаючи
        оплату та доставку супутніх товарів чи послуг, а також будь-які інші
        умови, гарантії або заяви, пов'язані з такими операціями, є виключно між
        Вами та таким рекламодавцем.
      </p>
      <p>
        Ми не несемо відповідальності за будь-які втрати чи пошкодження
        будь-якого роду, понесені в результаті будь-яких таких операцій або в
        результаті присутності таких рекламодавців на Сайті.
      </p>
    </div>
  );
};

export default Terms;
